#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Должность");
	Поля.Добавить("ДействуетНаОсновании");
	Поля.Добавить("Наименование");
	Поля.Добавить("Код");
	
КонецПроцедуры   

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СокрЛП(Данные.Наименование) + ?(СтрДлина(Данные.ДействуетНаОсновании)=0,"",СтрШаблон(" [на осн. %1]",СокрЛП(Данные.ДействуетНаОсновании)));
	
КонецПроцедуры 

#КонецОбласти